<?php
    #Задание 1

        $num = 0;
            while ($num < 100) {
            if ($num % 3 === 0) {
            echo $num.PHP_EOL;
            }
            ++$num;
            }
    
    #Задание 2

        $i = 0;

            do {
            if ($i == 0) {
                echo ($i . " - это ноль." . "<br>");
            } elseif ($i % 2 == 0) {
                echo ($i . " - четное число." . "<br>");
            } elseif ($i % 2 != 0) {
                echo ($i . " - нечетное число." . "<br>");
            }; 
            $i++;
            } 
            while ($i <= 10);
    #Задание 3

        $land = [
        'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
        'Ленинградская область' => ['Санкт-Петербург', 'Всесоложск', 'Павловск'],
        'Ульяновская область' => ['Рязань', 'Скопин', 'Сасово']
        ];
    
            foreach ($land as $key => $elem) {
                echo $key . ': ' . '<br>';
                
                foreach ($elem as $city) {
                    echo $city . ', '; //Так и не понял, как удалить в выводе лишнюю запятую.
                }
                echo '<br>' . '<br>';
            }
    
    #Задание 4
        function translit(string $str):string
        { 
            $arr = [
                'а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g', 'д' => 'd', 'е' => 'e', 'ё' => 'e',
                'ж' => 'zh', 'з' => 'z', 'и' => 'i', 'й' => 'y', 'к' => 'k', 'л' => 'l', 'м' => 'm',
                'н' => 'n', 'о' => 'o', 'п' => 'p', 'р' => 'r', 'с' => 's', 'т' => 't', 'у' => 'u',
                'ф' => 'f', 'х' => 'h', 'ц' => 'c', 'ч' => 'ch', 'ш' => 'sh', 'щ' => 'sch', 'ь' => '',
                'ы' => 'y', 'ъ' => '', 'э' => 'e', 'ю' => 'yu', 'я' => 'ya', 'А' => 'A', 'Б' => 'B',
                'В' => 'V', 'Г' => 'G', 'Д' => 'D', 'Е' => 'E', 'Ё' => 'E', 'Ж' => 'Zh', 'З' => 'Z',
                'И' => 'I', 'Й' => 'Y', 'К' => 'K', 'Л' => 'L', 'М' => 'M', 'Н' => 'N', 'О' => 'O',
                'П' => 'P', 'Р' => 'R', 'С' => 'S', 'Т' => 'T', 'У' => 'U', 'Ф' => 'F', 'Х' => 'H',
                'Ц' => 'C', 'Ч' => 'Ch', 'Ш' => 'Sh', 'Щ' => 'Sch', 'Ь' => '', 'Ы' => 'Y', 'Ъ' => '',
                'Э' => 'E', 'Ю' => 'Yu', 'Я' => 'Ya',
            ];
        
            $value = strtr($str, $arr);
            return $value;
        };
        
        echo translit('абвгдеёжзиклмнопрстуфхцчщьыъэюя АБВГДЕЁЖЗИКЛМНОПРСТУФХЦЧШЩЬЫЪЭЮЯ');    
        
    #Задание 5

        function replace(string $str):string {   
            return str_replace(' ', '_', $str);
        }

        echo replace('order filing out');

    #Задание 6
    
    #Задание 7

        for ($i = 0 -1; $i < 9; print(++$i.PHP_EOL));






?>