<?php
    #Задание 2
    $a = 5;
    $b = '05';
    var_dump($a == $b);         // Почему true? - Потому, что php у $b отбросил нуль и привел строку к int.
    var_dump((int)'012345');     // Почему 12345? Собственно тоже приведение к инту, с отбросом нуля.
    var_dump((float)123.0 === (int)123.0); // Почему false? Флоат и инт не тождевственно равны. Если == то true.
    var_dump((int)0 === (int)'hello, world'); /* Почему true? А вот тут не могу ответить точно. Но есть мнение, что строка hello, world приводится php к 0, так как в явном виде указан тип int.*/
   
    #Задание 3 
    // При смене версий php с 8.0 на 7.0 вывод не изменяется.

    #Задание 4

    $a = 1;
    $b = 2;

    $a = $a + $b; // 1 + 2 = 3
    $b = $a - $b; // 3 - 2 = 1
    $a = $a - $b; // 3 - 1 = 2

    echo '$a = '.$a.'<br>'.'$b = '.$b;
    // Выведет $a = 2 и $b = 1
?>