<?php

/* Задача 1 ГОТОВО
1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.
*/

$rangePointer = 0;
$rangeEnd = 100;

while ($rangePointer <= $rangeEnd) {
    if ($rangePointer % 3 == 0) {
        print_r($rangePointer . PHP_EOL);
    }
    $rangePointer += 1;
}

/* Задача 2 ГОТОВ

2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
0 – это ноль.
1 – нечетное число.
2 – четное число.
3 – нечетное число.
…
10 – четное число.
*/

$rangePointer = 0;
$rangeEnd = 10;

do {

    if ($rangePointer == 0) {
        print_r($rangePointer . " - это ноль." . PHP_EOL);
    } else if ($rangePointer % 2 == 0) {
        print_r($rangePointer . " - четное число." . PHP_EOL);
    } else {
        print_r($rangePointer . " - нечетное число." . PHP_EOL);
    }
    $rangePointer += 1;
} while ($rangePointer <= $rangeEnd);

/* Задача 3  ГОТОВО

3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким:
Московская область:
Москва, Зеленоград, Клин
Ленинградская область:
Санкт-Петербург, Всеволожск, Павловск, Кронштадт
Рязанская область … (названия городов можно найти на maps.yandex.ru)
*/

$regions = [
    "Амурская" => [
        "Благовещенск",
        "Белогорск",
        "Свободный",
        "Тында",
        "Зея"
    ],
    /*
    "Архангельская" => [],
    "Астраханская" => [],
    "Белгородская" => [],
*/
    "Брянская" => [
        "Брянск",
        "Клинцы",
        "Новозыбков",
        "Дятьково",
        "Унеча",
        "Карачев",
        "Стародуб"
    ],
    /*
    "Владимирская" => [],
    "Волгоградская" => [],
    "Вологодская" => [],
    "Воронежская" => [],
*/
    "Ивановская" => [
        "Иваново",
        "Кинешма",
        "Шуя",
        "Вичуга"
    ],
    /*
    "Иркутская" => [],
    "Калининградская" => [],
    "Калужская" => [],
*/
    "Кемеровская" => [
        "Кемерово",
        "Новокузнецк",
        "Прокопьевск",
        "Междуреченск",
        "Ленинск-Кузнецкий",
        "Киселевск"
    ],
    /*
    "Кировская" => [],
    "Костромская" => [],
    "Курганская" => [],
    "Курская" => [],
    "Ленинградская" => [],
*/
    "Липецкая" => [
        "Липецк",
        "Елец",
        "Грязи",
        "Данков",
        "Лебедянь",
        "Усмань",
        "Чаплыгин",
        "Задонск"
    ],
    /*
    "Магаданская"     => [],
    "Московская" => [],
    "Мурманская" => [],
*/
    "Нижегородская" => [
        "Нижний Новгород",
        "Дзержинск",
        "Арзамас",
        "Саров",
        "Бор",
        "Кстово"
    ],
    /*
    "Новгородская" => [],
    "Новосибирская" => [],
    "Омская" => [],
    "Оренбургская" => [],
    "Орловская" => [],
    "Пензенская" => [],
    "Псковская" => [],
    "Ростовская" => [],
    "Рязанская" => [],
    "Самарская" => [],
    "Саратовская" => [],
    "Саратовская" => [],
    "Сахалинская" => [],
    "Свердловская" => [],
    "Смоленская" => [],
    "Тамбовская" => [],
    "Тверская" => [],
    "Томская" => [],
    "Тульская" => [],
    "Тюменская"     => [],
    "Ульяновская" => [],
    "Челябинская" => [],
    "Ярославская" => [],
    "Еврейская автономная"  => []
*/
];

foreach ($regions as $rName => $rCities) {
    print_r($rName . " область:" . PHP_EOL);
    print_r(implode(", ", $rCities) . PHP_EOL);
};

/* Задача 8 ГОТОВО
8* Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».
*/

foreach ($regions as $rName => $rCities) {
    print_r($rName . " область:" . PHP_EOL);
    $selectedCities = [];
    foreach ($rCities as $elem) {
        if (mb_substr($elem, 0, 1) == 'К') {
            $selectedCities[] = $elem;
        }
    }
    print_r(implode(", ", $selectedCities) . PHP_EOL);
};

/* Задача 7 ГОТОВО
7* Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. То есть выглядеть должно так:
for (…){ // здесь пусто}
*/

for ($i = 0; $i < 10; print $i . PHP_EOL, $i++) {
};


/* Задача 4
4. бъявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
Написать функцию транслитерации строк.
*/

/* Задача 5
5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.
*/

/* Задача 9
9* Объединить две ранее написанные функции в одну, которая получает строку на русском языке, производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается при конструировании url-адресов на основе названия статьи в блогах).
*/





/* Задача 6 Связано с версткой. Не делал

6. В имеющемся шаблоне сайта заменить статичное меню (ul - li) на генерируемое через PHP. Необходимо представить пункты меню как элементы массива и вывести их циклом. Подумать, как можно реализовать меню с вложенными подменю? Попробовать его реализовать.
*/

<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title> Home Work 7 Functions </title>
    </title>
</head>

<body>
    <footer>
        <div style="text-align:center; font-size:100px; font-weight:bold">
            <?= Date("Y") ?>
        </div>
    </footer>
</body>

</html>